:PROPERTIES:
:ID:       8d789c98-5e74-4bf8-9226-52fb43c5ca51
:END:
#+TITLE: Gitforge

* Metaforge

** Resources

** Topics

* Gitlab

** Docs

** Resources
+ [[https://docs.gitlab.com/ee/install/docker.html][Gitlab Docker Images]]

*** Gitlab Environment Toolkit

Walkthroughs explaining setup of advanced gitlab features & service integrations
on multiple cloud providers. Req. terraform, but offers overview of the ins/outs
of gitlab.

+ [[https://gitlab.com/gitlab-org/gitlab-environment-toolkit/-/blob/main/docs/environment_configure.md][Configuring the environment with ansible]] (roam: [[id:ac2a1ae4-a695-4226-91f0-8386dc4d9b07][DevOps]])
+ [[https://gitlab.com/gitlab-org/gitlab-environment-toolkit/-/blob/main/docs/environment_post_considerations.md][Backups/security]]
+ [[https://gitlab.com/gitlab-org/gitlab-environment-toolkit/-/tree/main/examples][Example deploys on cloud/hybrid]] (both google cloud and aws)
* Github

** Docs
*** API

*** GraphQL API

See [[https://github.com/magit/ghub/blob/main/lisp/ghub-graphql.el][ghub-graphql.el]] in [[https://github.com/magit/ghub][magit/ghub]] for API, particularly the queries defined as
=defconstant= like =ghub-fetch-repository= and the matching =cl-defun=.

And see [[https://github.com/vermiculus/graphql.el][vermiculus/graphql.el]] for graphql queries generally.
** Resources
*** Searches
+ Find repos with =.github/workflows= defined [[https://github.com/search?q=path%3A%2F%5E%5C.github%5C%2Fworkflows%5C%2F.*%5C.yaml%24%2F&type=code][path:/^\.github\/workflows\/.*\.yaml$/]]


*** Org Management

+ [[https://github.com/klcodanr/github-settings-sync][klcodanr/github-settings-sync]]
+ [[https://github.com/bretfisher/gasa][bretfisher/gasa]]

** Topics
*** Github Backend
**** [[https://dl.acm.org/doi/10.1145/3487019.3487022][Static Analysis at GitHub: An experience report]] (2021)

Kafka launches treesitter workers.

*** GraphQL


** Issues

*** Master & Main

**** Determine master/main ref without Github API

See docs on [[https://git-scm.com/docs/git-ls-remote][git-ls-remote]].

This would work if the branch is renamed, but maybe not if there are two
concurrently maintained branches.

#+begin_src sh
head_sha="$(git ls-remote https://github.com/tensorflow/tensorflow --patterns HEAD | cut -f1)"
git ls-remote https://github.com/tensorflow/tensorflow | grep "$head_sha"
echo $head_sha
#+end_src

#+RESULTS:
| 9dab91d727cc604a7a25253c94b2997f93b5b894	HEAD                 |
| 9dab91d727cc604a7a25253c94b2997f93b5b894	refs/heads/master    |
| 9dab91d727cc604a7a25253c94b2997f93b5b894	refs/pull/69097/head |
| 9dab91d727cc604a7a25253c94b2997f93b5b894                       |

*** Clone Bundle

**** Get Clone Bundle Size

There doesn't seem to be a way to do this with =graphql= or =curl=.

***** Using Git

There is with git (see [[https://stackoverflow.com/questions/8185276/find-size-of-git-repository][stack overflow]]) using =git-count-objects= or
=git-gc=... but it looks like you have to clone. If it's a bare repository, that
may work, but it's unclear whether it needs the content to be fetched locally.



***** Using Curl

This should work, but it returns =Content-Length: 0= and doesn't output in JSON
anyways.

#+begin_src sh :results output table
# the clone zip for the wiki pathways database and their like SVG assets
wikipathways_db=https://github.com/wikipathways/wikipathways-database/archive/refs/heads/main.zip
wikipathways_assets=https://github.com/wikipathways/wikipathways-assets/archive/refs/heads/main.zip

# the repo for the assets is 4GB
#curl -sLI -w "%{header_json}" -o /dev/null $wikipathways_db
#curl -sLI -w "%{header_json}" -o /dev/null $wikipathways_assets

curl -sLI $wikipathways_db | grep "content-length"
curl -sLI $wikipathways_assets | grep "content-length"
printf ""
#+end_src

#+RESULTS:
| content-length: | 0 |
| content-length: | 0 |

* Github Actions

** Docs
+ [[https://docs.github.com/en/actions/security-guides/using-secrets-in-github-actions][Using Secrets in Github Actions]]
+ NaCl [[https://libsodium.gitbook.io/doc/public-key_cryptography/sealed_boxes][libsodium sealed boxes]] use X25519 and XSalsa20-Poly1305.


** Resources


** Topics

*** Secrets

The usage of =crypto_box= implies the key needs a secondary method of encryption
to be safely stored.

*** Secrets Encryption

Crypto Box

| Key exchange | Encryption | Authentication |
|--------------+------------+----------------|
| X25519       | XSalsa20   | Poly1305       |

**** x25519 Support

+ [[https://github.com/arekinath/pivy][arekinath/pivy]] can work with =crypto_box= (and it is agent-based YAY!) ... but
  it's an =ebox= which doesn't use =Curve22519= ... so nevermind. PIV itself
  [[https://github.com/str4d/age-plugin-yubikey/issues/70][doesn't support x25519]].

***** On x25519

x25519 key exchange offers [[https://libsodium.gitbook.io/doc/public-key_cryptography/authenticated_encryption][authenticated encryption]] (which is probably why it's
difficult to work into the PIV specification). This is similar to signing, but
means that someone can validate whether a decryptable secret was encrypted by
someone (i guess it's similar to signing)

#+begin_quote
Based on BobвЂ™s public key, Alice can compute a shared secret key. Using AliceвЂ™s
public key and his secret key, Bob can compute the same shared secret key. That
shared secret key can be used to verify that the encrypted message was not
tampered with before decryption.
#+end_quote

If i'm getting this correctly:

+ $f : A_{priv}, B_{pub} \rightarrow AB_{shared}$
+ and $f\prime : A_{pub}, B_{priv} \rightarrow AB_{shared}$
+ but also maps between pub/private keys

So, I'm skeptical because symmetry must satisfy critical properties in crypto.
You want functions that transform domains into ranges where measure is
near-uniform.

+ The maps should "mix" values going from message-space to cipher-space and this
  should be computationally easy.
+ Entropy should be high in cipher-space (the values are well-mixed)
+ Unmixing the values should be computationally hard without the keys.
+ You can easily create functions that transform a domain into uniform measure
  which are also easily reversed.

So, you must violate some kinds of symmetry while preserving others. This and
not all elliptic curves are created equally ... i'm pessimistic, not optimistic.
I guess the maps $f, f\prime$ above are only used for authentication. IDK
though.

* Gitea, Forgejo and Codeberg

** Docs
+ [[https://docs.gitea.com/api][API]] and [[https://codeberg.org/api/swagger][Codeberg API]]
  
** Resources

** Topics

*** Pull Requests

**** Fork Workflow

On a private instance, use the =agit= refs to avoid needing to pull from clones

+ https://forgejo.org/docs/next/user/agit-support/
+ https://docs.gitea.com/next/usage/agit-setup

*** API

**** Paths

Visualizes all the paths, but doesn't describe the verbs

#+begin_src shell :results output replace :wrap verse
openapi="https://raw.githubusercontent.com/obsidiansystems/gitea-api/refs/heads/master/openapi.yaml"
curl -sq $openapi | yq -r '.paths | keys | join("\n")' | tree --noreport --fromfile .
#+end_src

#+RESULTS:
#+begin_verse
.
в”њв”Ђв”Ђ activitypub
в”‚В В  в””в”Ђв”Ђ user-id
в”‚В В      в””в”Ђв”Ђ {user-id}
в”‚В В          в””в”Ђв”Ђ inbox
в”њв”Ђв”Ђ admin
в”‚В В  в”њв”Ђв”Ђ cron
в”‚В В  в”‚В В  в””в”Ђв”Ђ {task}
в”‚В В  в”њв”Ђв”Ђ emails
в”‚В В  в”‚В В  в””в”Ђв”Ђ search
в”‚В В  в”њв”Ђв”Ђ hooks
в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”њв”Ђв”Ђ orgs
в”‚В В  в”њв”Ђв”Ђ runners
в”‚В В  в”‚В В  в””в”Ђв”Ђ registration-token
в”‚В В  в”њв”Ђв”Ђ unadopted
в”‚В В  в”‚В В  в””в”Ђв”Ђ {owner}
в”‚В В  в”‚В В      в””в”Ђв”Ђ {repo}
в”‚В В  в””в”Ђв”Ђ users
в”‚В В      в””в”Ђв”Ђ {username}
в”‚В В          в”њв”Ђв”Ђ badges
в”‚В В          в”њв”Ђв”Ђ keys
в”‚В В          в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В          в”њв”Ђв”Ђ orgs
в”‚В В          в”њв”Ђв”Ђ rename
в”‚В В          в””в”Ђв”Ђ repos
в”њв”Ђв”Ђ gitignore
в”‚В В  в””в”Ђв”Ђ templates
в”‚В В      в””в”Ђв”Ђ {name}
в”њв”Ђв”Ђ label
в”‚В В  в””в”Ђв”Ђ templates
в”‚В В      в””в”Ђв”Ђ {name}
в”њв”Ђв”Ђ licenses
в”‚В В  в””в”Ђв”Ђ {name}
в”њв”Ђв”Ђ markdown
в”‚В В  в””в”Ђв”Ђ raw
в”њв”Ђв”Ђ markup
в”њв”Ђв”Ђ nodeinfo
в”њв”Ђв”Ђ notifications
в”‚В В  в”њв”Ђв”Ђ new
в”‚В В  в””в”Ђв”Ђ threads
в”‚В В      в””в”Ђв”Ђ {id}
в”њв”Ђв”Ђ org
в”‚В В  в””в”Ђв”Ђ {org}
в”‚В В      в””в”Ђв”Ђ repos
в”њв”Ђв”Ђ orgs
в”‚В В  в””в”Ђв”Ђ {org}
в”‚В В      в”њв”Ђв”Ђ actions
в”‚В В      в”‚В В  в”њв”Ђв”Ђ runners
в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ registration-token
в”‚В В      в”‚В В  в”њв”Ђв”Ђ secrets
в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {secretname}
в”‚В В      в”‚В В  в””в”Ђв”Ђ variables
в”‚В В      в”‚В В      в””в”Ђв”Ђ {variablename}
в”‚В В      в”њв”Ђв”Ђ activities
в”‚В В      в”‚В В  в””в”Ђв”Ђ feeds
в”‚В В      в”њв”Ђв”Ђ avatar
в”‚В В      в”њв”Ђв”Ђ blocks
в”‚В В      в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В      в”њв”Ђв”Ђ hooks
в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В      в”њв”Ђв”Ђ labels
в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В      в”њв”Ђв”Ђ members
в”‚В В      в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В      в”њв”Ђв”Ђ public_members
в”‚В В      в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В      в”њв”Ђв”Ђ repos
в”‚В В      в””в”Ђв”Ђ teams
в”‚В В          в””в”Ђв”Ђ search
в”њв”Ђв”Ђ packages
в”‚В В  в””в”Ђв”Ђ {owner}
в”‚В В      в””в”Ђв”Ђ {type}
в”‚В В          в””в”Ђв”Ђ {name}
в”‚В В              в””в”Ђв”Ђ {version}
в”‚В В                  в””в”Ђв”Ђ files
в”њв”Ђв”Ђ repos
в”‚В В  в”њв”Ђв”Ђ issues
в”‚В В  в”‚В В  в””в”Ђв”Ђ search
в”‚В В  в”њв”Ђв”Ђ migrate
в”‚В В  в”њв”Ђв”Ђ {owner}
в”‚В В  в”‚В В  в””в”Ђв”Ђ {repo}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ actions
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ runners
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ registration-token
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ secrets
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {secretname}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ tasks
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ variables
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ {variablename}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ activities
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ feeds
в”‚В В  в”‚В В      в”њв”Ђв”Ђ archive
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {archive}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ assignees
в”‚В В  в”‚В В      в”њв”Ђв”Ђ avatar
в”‚В В  в”‚В В      в”њв”Ђв”Ђ branches
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {branch}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ branch_protections
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {name}
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ priority
в”‚В В  в”‚В В      в”њв”Ђв”Ђ collaborators
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {collaborator}
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ permission
в”‚В В  в”‚В В      в”њв”Ђв”Ђ commits
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {ref}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ status
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ statuses
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ pull
в”‚В В  в”‚В В      в”њв”Ђв”Ђ compare
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {basehead}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ contents
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {filepath}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ diffpatch
в”‚В В  в”‚В В      в”њв”Ђв”Ђ editorconfig
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {filepath}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ forks
в”‚В В  в”‚В В      в”њв”Ђв”Ђ git
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ blobs
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ commits
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {sha}.{diffType}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ notes
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ refs
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {ref}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ tags
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ trees
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ hooks
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ git
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ tests
в”‚В В  в”‚В В      в”њв”Ђв”Ђ issue_config
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ validate
в”‚В В  в”‚В В      в”њв”Ђв”Ђ issues
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ comments
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В      в”њв”Ђв”Ђ assets
в”‚В В  в”‚В В      в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {attachment_id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В      в””в”Ђв”Ђ reactions
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {index}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ assets
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {attachment_id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ blocks
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ comments
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ deadline
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ dependencies
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ labels
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ pin
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {position}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ reactions
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ stopwatch
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в”њв”Ђв”Ђ delete
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в”њв”Ђв”Ђ start
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ stop
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ subscriptions
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в”њв”Ђв”Ђ check
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {user}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ timeline
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ times
в”‚В В  в”‚В В      в”‚В В  в”‚В В      в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ pinned
в”‚В В  в”‚В В      в”њв”Ђв”Ђ issue_templates
в”‚В В  в”‚В В      в”њв”Ђв”Ђ keys
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ labels
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ languages
в”‚В В  в”‚В В      в”њв”Ђв”Ђ licenses
в”‚В В  в”‚В В      в”њв”Ђв”Ђ media
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {filepath}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ merge-upstream
в”‚В В  в”‚В В      в”њв”Ђв”Ђ milestones
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ mirror-sync
в”‚В В  в”‚В В      в”њв”Ђв”Ђ new_pin_allowed
в”‚В В  в”‚В В      в”њв”Ђв”Ђ notifications
в”‚В В  в”‚В В      в”њв”Ђв”Ђ pulls
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {base}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ {head}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {index}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ commits
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ files
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ merge
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ requested_reviewers
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”њв”Ђв”Ђ reviews
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В      в”њв”Ђв”Ђ comments
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В      в”њв”Ђв”Ђ dismissals
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в”‚В В      в””в”Ђв”Ђ undismissals
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ update
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {index}.{diffType}
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ pinned
в”‚В В  в”‚В В      в”њв”Ђв”Ђ push_mirrors
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {name}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ push_mirrors-sync
в”‚В В  в”‚В В      в”њв”Ђв”Ђ raw
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {filepath}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ releases
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”‚В В  в”‚В В  в””в”Ђв”Ђ assets
в”‚В В  в”‚В В      в”‚В В  в”‚В В      в””в”Ђв”Ђ {attachment_id}
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ latest
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ tags
в”‚В В  в”‚В В      в”‚В В      в””в”Ђв”Ђ {tag}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ reviewers
в”‚В В  в”‚В В      в”њв”Ђв”Ђ signing-key.gpg
в”‚В В  в”‚В В      в”њв”Ђв”Ђ stargazers
в”‚В В  в”‚В В      в”њв”Ђв”Ђ statuses
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {sha}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ subscribers
в”‚В В  в”‚В В      в”њв”Ђв”Ђ subscription
в”‚В В  в”‚В В      в”њв”Ђв”Ђ tag_protections
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ tags
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {tag}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ teams
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {team}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ times
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {user}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ topics
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ {topic}
в”‚В В  в”‚В В      в”њв”Ђв”Ђ transfer
в”‚В В  в”‚В В      в”‚В В  в”њв”Ђв”Ђ accept
в”‚В В  в”‚В В      в”‚В В  в””в”Ђв”Ђ reject
в”‚В В  в”‚В В      в””в”Ђв”Ђ wiki
в”‚В В  в”‚В В          в”њв”Ђв”Ђ new
в”‚В В  в”‚В В          в”њв”Ђв”Ђ page
в”‚В В  в”‚В В          в”‚В В  в””в”Ђв”Ђ {pageName}
в”‚В В  в”‚В В          в”њв”Ђв”Ђ pages
в”‚В В  в”‚В В          в””в”Ђв”Ђ revisions
в”‚В В  в”‚В В              в””в”Ђв”Ђ {pageName}
в”‚В В  в”њв”Ђв”Ђ search
в”‚В В  в””в”Ђв”Ђ {template_owner}
в”‚В В      в””в”Ђв”Ђ {template_repo}
в”‚В В          в””в”Ђв”Ђ generate
в”њв”Ђв”Ђ repositories
в”‚В В  в””в”Ђв”Ђ {id}
в”њв”Ђв”Ђ settings
в”‚В В  в”њв”Ђв”Ђ api
в”‚В В  в”њв”Ђв”Ђ attachment
в”‚В В  в”њв”Ђв”Ђ repository
в”‚В В  в””в”Ђв”Ђ ui
в”њв”Ђв”Ђ signing-key.gpg
в”њв”Ђв”Ђ teams
в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В      в”њв”Ђв”Ђ activities
в”‚В В      в”‚В В  в””в”Ђв”Ђ feeds
в”‚В В      в”њв”Ђв”Ђ members
в”‚В В      в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В      в””в”Ђв”Ђ repos
в”‚В В          в””в”Ђв”Ђ {org}
в”‚В В              в””в”Ђв”Ђ {repo}
в”њв”Ђв”Ђ topics
в”‚В В  в””в”Ђв”Ђ search
в”њв”Ђв”Ђ user
в”‚В В  в”њв”Ђв”Ђ actions
в”‚В В  в”‚В В  в”њв”Ђв”Ђ runners
в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ registration-token
в”‚В В  в”‚В В  в”њв”Ђв”Ђ secrets
в”‚В В  в”‚В В  в”‚В В  в””в”Ђв”Ђ {secretname}
в”‚В В  в”‚В В  в””в”Ђв”Ђ variables
в”‚В В  в”‚В В      в””в”Ђв”Ђ {variablename}
в”‚В В  в”њв”Ђв”Ђ applications
в”‚В В  в”‚В В  в””в”Ђв”Ђ oauth2
в”‚В В  в”‚В В      в””в”Ђв”Ђ {id}
в”‚В В  в”њв”Ђв”Ђ avatar
в”‚В В  в”њв”Ђв”Ђ blocks
в”‚В В  в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В  в”њв”Ђв”Ђ emails
в”‚В В  в”њв”Ђв”Ђ followers
в”‚В В  в”њв”Ђв”Ђ following
в”‚В В  в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В  в”њв”Ђв”Ђ gpg_keys
в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”њв”Ђв”Ђ gpg_key_token
в”‚В В  в”њв”Ђв”Ђ gpg_key_verify
в”‚В В  в”њв”Ђв”Ђ hooks
в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”њв”Ђв”Ђ keys
в”‚В В  в”‚В В  в””в”Ђв”Ђ {id}
в”‚В В  в”њв”Ђв”Ђ orgs
в”‚В В  в”њв”Ђв”Ђ repos
в”‚В В  в”њв”Ђв”Ђ settings
в”‚В В  в”њв”Ђв”Ђ starred
в”‚В В  в”‚В В  в””в”Ђв”Ђ {owner}
в”‚В В  в”‚В В      в””в”Ђв”Ђ {repo}
в”‚В В  в”њв”Ђв”Ђ stopwatches
в”‚В В  в”њв”Ђв”Ђ subscriptions
в”‚В В  в”њв”Ђв”Ђ teams
в”‚В В  в””в”Ђв”Ђ times
в”њв”Ђв”Ђ users
в”‚В В  в”њв”Ђв”Ђ search
в”‚В В  в””в”Ђв”Ђ {username}
в”‚В В      в”њв”Ђв”Ђ activities
в”‚В В      в”‚В В  в””в”Ђв”Ђ feeds
в”‚В В      в”њв”Ђв”Ђ followers
в”‚В В      в”њв”Ђв”Ђ following
в”‚В В      в”‚В В  в””в”Ђв”Ђ {target}
в”‚В В      в”њв”Ђв”Ђ gpg_keys
в”‚В В      в”њв”Ђв”Ђ heatmap
в”‚В В      в”њв”Ђв”Ђ keys
в”‚В В      в”њв”Ђв”Ђ orgs
в”‚В В      в”‚В В  в””в”Ђв”Ђ {org}
в”‚В В      в”‚В В      в””в”Ђв”Ђ permissions
в”‚В В      в”њв”Ђв”Ђ repos
в”‚В В      в”њв”Ђв”Ђ starred
в”‚В В      в”њв”Ђв”Ђ subscriptions
в”‚В В      в””в”Ђв”Ђ tokens
в”‚В В          в””в”Ђв”Ђ {token}
в””в”Ђв”Ђ version
#+end_verse

* Roam
+ [[id:96ea2679-1c00-4144-a97a-c1db570b7407][Github]]
+ [[id:a7cc960b-4174-4029-bf38-9966894eeeee][OpenAPI]]
